testcases/perturbation/0/Psi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "178500.00000589207";
    object      Psi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
30000
(
-1.1203068722523787937
-1.1201523434982383343
-1.1201015897527570875
-1.1200807546581028618
-1.1200704247341135567
-1.1200645867496024088
-1.1200610092168896692
-1.1200587132477435315
...
)
;

boundaryField
{
    left
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
100
(
-1.1205950216140343478
-1.0580897597267682197
-1.000413097957086217
-0.94711072130701889904
-0.89778388516956786347
-0.85208073897559422072
-0.80968932112090175046
-0.77033184638778440245
...
)
;
    }
    right
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
100
(
-1.1207108783334831514
-1.0582056164462156911
-1.0005289546765343545
-0.94722657802646703651
-0.89789974188901600094
-0.85219659569504235819
-0.80980517784034988793
-0.77044770310723253992
...
)
;
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
    top
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
300
(
-1.1536985027840371831
-1.1536990367710198147
-1.1536995682796671314
-1.153700097321481266
-1.1537006239079117265
-1.1537011480503538419
-1.1537016697601509829
-1.1537021890485934517
...
)
;
    }
    bottom
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
300
(
-1.1536985027840371831
-1.1536990367710198147
-1.1536995682796671314
-1.153700097321481266
-1.1537006239079117265
-1.1537011480503538419
-1.1537016697601509829
-1.1537021890485934517
...
)
;
    }
}


// ************************************************************************* //
