testcases/perturbation/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "178500.00000589207";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -1 0 0 0 0 0];

internalField   nonuniform List<vector> 
30000
(
(3.4131281506236631725e-09 -1.5381674026424772996e-13 0)
(3.4132125573030109822e-09 1.2776969036484856319e-14 0)
(3.4132291362449338944e-09 -8.4664586929502747837e-14 1.2366044345967772386e-27)
(3.4132463149901017495e-09 2.4599575483727564686e-14 -1.2378308441053460401e-27)
(3.4132400969867635494e-09 -7.8563683731521137988e-14 1.5457805906656112204e-28)
(3.4132435822905271361e-09 1.9077576730176659153e-14 -1.3455856970121542165e-27)
(3.413236378307277133e-09 -8.1608722759090110515e-14 1.8113321512813658597e-27)
(3.4132364732258417283e-09 1.10888211058208571e-14 0)
...
)
;

boundaryField
{
    left
    {
        type            zeroGradient;
    }
    right
    {
        type            zeroGradient;
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
    top
    {
        type            noSlip;
    }
    bottom
    {
        type            noSlip;
    }
}


// ************************************************************************* //
