testcases/perturbation/0/n1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "178500.00000589207";
    object      n1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
30000
(
1.5328970236127645865
1.5326593452243748583
1.5325807451728810094
1.5325480019366983786
1.5325313644910620869
1.5325216131883629966
1.5325153315212298732
1.5325110160166732776
...
)
;

boundaryField
{
    left
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
100
(
1.5333392002261865272
1.4404312950094173562
1.3597024885491992841
1.2891248028837498651
1.2270791917622470013
1.1722600572777215344
1.1236048588085978395
1.0802415416733821552
...
)
;
    }
    right
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
100
(
1.5333392002261865272
1.4404312950094173562
1.3597024885491992841
1.2891248028837498651
1.2270791917622470013
1.1722600572777215344
1.1236048588085978395
1.0802415416733821552
...
)
;
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
    top
    {
        type            fixedValue;
        value           uniform 1.58494713682089583;
    }
    bottom
    {
        type            fixedValue;
        value           uniform 1.58494713682089583;
    }
}


// ************************************************************************* //
