testcases/perturbation/0/n2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "178500.00000589207";
    object      n2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
30000
(
0.16308988142680125311
0.16311518092901550192
0.16312353833161144512
0.16312703169511150181
0.16312879453060757928
0.16312984065810903767
0.16313050125986644501
0.16313096873595647751
...
)
;

boundaryField
{
    left
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
100
(
0.16304285442067997791
0.17355912834312972604
0.18386375115540876113
0.1939300209264101793
0.2037358319481949176
0.21326325882036956116
0.22249814784984534022
0.23142972229408029228
...
)
;
    }
    right
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
100
(
0.16304285442067997791
0.17355912834312972604
0.18386375115540876113
0.1939300209264101793
0.2037358319481949176
0.21326325882036956116
0.22249814784984534022
0.23142972229408029228
...
)
;
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
    top
    {
        type            fixedValue;
        value           uniform 0.15773396739367137598;
    }
    bottom
    {
        type            fixedValue;
        value           uniform 0.15773396739367137598;
    }
}


// ************************************************************************* //
