testcases/perturbation/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "178500.00000589207";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
30000
(
5.3973682431634448872e-10
6.310484266291296541e-10
9.9685608712159795958e-10
8.7803730367469369242e-10
1.1998555111225197494e-09
1.0846935257872149585e-09
1.3846586214991324163e-09
1.2755392996492792524e-09
...
)
;

boundaryField
{
    left
    {
        type            fixedValue;
        value           uniform 0;
    }
    right
    {
        type            fixedValue;
        value           uniform 0;
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
    top
    {
        type            zeroGradient;
    }
    bottom
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
