testcases/perturbation/0/v1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "178500.00000589207";
    object      v1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -1 0 0 0 0 0];

internalField   nonuniform List<vector> 
30000
(
(9.5890602510554555471e-08 -3.337836286161304912e-11 0)
(9.5924177729619965878e-08 -1.2639102722680392593e-11 0)
(9.590878299356517909e-08 -3.2065712167501823767e-11 -1.3649448903063974763e-15)
(9.5918274681708064333e-08 -2.5024181423894631965e-11 1.3713093987808558026e-15)
(9.5910365935922679586e-08 -3.5421260077904124613e-11 -1.6913019617493208326e-16)
(9.5915327372105495164e-08 -3.3968282669200169681e-11 1.0458700844240871235e-15)
(9.5910678379265197001e-08 -4.166786759629467683e-11 -1.5597151527489196504e-15)
(9.591397644450334286e-08 -4.252738942358477341e-11 0)
...
)
;

boundaryField
{
    left
    {
        type            zeroGradient;
    }
    right
    {
        type            zeroGradient;
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
    top
    {
        type            zeroGradient;
    }
    bottom
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
