testcases/perturbation/0/v2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "178500.00000589207";
    object      v2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -1 0 0 0 0 0];

internalField   nonuniform List<vector> 
30000
(
(-9.2564945483780599073e-08 -5.8813621513132514914e-10 0)
(-9.2529609992558468283e-08 5.2649518600240222708e-10 0)
(-9.2547262883123498079e-08 -5.9602156653929328599e-10 -1.3649385918865820614e-15)
(-9.2533643633685652123e-08 4.9424493086266064439e-10 1.3713030709925679212e-15)
(-9.2545974637264614485e-08 -6.0768907284203696181e-10 -1.6912902966566102799e-16)
(-9.2535196313104548443e-08 4.6527475031134447688e-10 1.0458602407573060299e-15)
(-9.2546076210172523048e-08 -6.2155809990439207257e-10 -1.5597007314156260294e-15)
(-9.2535246325074072986e-08 4.3657924834531340826e-10 0)
...
)
;

boundaryField
{
    left
    {
        type            zeroGradient;
    }
    right
    {
        type            zeroGradient;
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
    top
    {
        type            zeroGradient;
    }
    bottom
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
