testcases/perturbation/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    left
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       59600;
    }
    right
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       59700;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          30000;
        startFace       59800;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          30000;
        startFace       89800;
    }
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          300;
        startFace       119800;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          300;
        startFace       120100;
    }
)

// ************************************************************************* //
