testcases/perturbation/system/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
momentumSource1
{
    type            vectorSemiImplicitSource;

    active yes;
    volumeMode      absolute;

    selectionMode   cellSet;
    cellSet middle;

    injectionRateSuSp
    {
        U           ((0.01 0 0) 0) ;
    }
}





// ************************************************************************* //
